package utils

import "strings"

func AnscTPUtf8(str string) string {
	array1 := []string{
		"Ã€", "Ã", "Ã‚", "Ãƒ", "Ãˆ", "Ã‰", "ÃŠ", "ÃŒ", "Ã", "Ã’", "Ã“", "Ã”", "Ã•", "Ã™", "Ãš", "Ã", "Ã ", "Ã¡", "Ã¢", "Ã£", "Ã¨", "Ã©", "Ãª", "Ã¬", "Ã­", "Ã²", "Ã³", "Ã´", "Ãµ", "Ã¹", "Ãº", "Ã½", "Ä‚", "Äƒ", "Ä", "Ä‘", "Ä¨", "Ä©", "Å¨", "Å©", "Æ ", "Æ¡", "Æ¯", "Æ°", "áº ", "áº¡", "áº¢", "áº£", "áº¤", "áº¥", "áº¦", "áº§", "áº¨", "áº©", "áºª", "áº«", "áº¬", "áº­", "áº®", "áº¯", "áº°", "áº±", "áº²", "áº³", "áº´", "áºµ", "áº¶", "áº·", "áº¸", "áº¹", "áºº", "áº»", "áº¼", "áº½", "áº¾", "áº¿", "á»€", "á»", "á»‚", "á»ƒ", "á»„", "á»…", "á»†", "á»‡", "á»ˆ", "á»‰", "á»Š", "á»‹", "á»Œ", "á»", "á»Ž", "á»", "á»", "á»‘", "á»’", "á»“", "á»”", "á»•", "á»–", "á»—", "á»˜", "á»™", "á»š", "á»›", "á»œ", "á»", "á»ž", "á»Ÿ", "á» ", "á»¡", "á»¢", "á»£", "á»¤", "á»¥", "á»¦", "á»§", "á»¨", "á»©", "á»ª", "á»«", "á»¬", "á»­", "á»®", "á»¯", "á»°", "á»±", "á»²", "á»³", "á»´", "á»µ", "á»¶", "á»·", "á»¸", "á»¹",
	}

	array2 := []string{
		"À", "Á", "Â", "Ã", "È", "É", "Ê", "Ì", "Í", "Ò", "Ó", "Ô", "Õ", "Ù", "Ú", "Ý", "à", "á", "â", "ã", "è", "é", "ê", "ì", "í", "ò", "ó", "ô", "õ", "ù",
		"ú", "ý", "Ă", "ă", "Đ", "đ", "Ĩ", "ĩ", "Ũ", "ũ", "Ơ", "ơ", "Ư", "ư", "Ạ", "ạ", "Ả", "ả", "Ấ", "ấ", "Ầ", "ầ", "Ẩ", "ẩ", "Ẫ", "ẫ", "Ậ", "ậ", "Ắ", "ắ", "Ằ", "ằ", "Ẳ", "ẳ", "Ẵ", "ẵ", "Ặ", "ặ", "Ẹ", "ẹ", "Ẻ", "ẻ", "Ẽ", "ẽ", "Ế", "ế", "Ề", "ề", "Ể", "ể", "Ễ", "ễ", "Ệ", "ệ", "Ỉ", "ỉ", "Ị", "ị", "Ọ", "ọ", "Ỏ", "ỏ", "Ố", "ố", "Ồ", "ồ", "Ổ", "ổ", "Ỗ", "ỗ", "Ộ", "ộ", "Ớ", "ớ", "Ờ", "ờ", "Ở", "ở", "Ỡ", "ỡ", "Ợ", "ợ", "Ụ", "ụ", "Ủ", "ủ", "Ứ", "ứ", "Ừ", "ừ", "Ử", "ử", "Ữ", "ữ", "Ự", "ự", "Ỳ", "ỳ", "Ỵ", "ỵ", "Ỷ", "ỷ", "Ỹ", "ỹ",
	}

	str = strings.NewReplacer(zip(array1, array2)...).Replace(str)

	return str
}
func zip(a1, a2 []string) []string {
	r := make([]string, 2*len(a1))
	for i, e := range a1 {
		r[i*2] = e
		r[i*2+1] = a2[i]
	}
	return r
}
